#+TITLE: Dados: O PIB da pandemia e cenários para 2021
#+DATE: Janeiro de 2021
#+LATEX_CLASS: SelfArx
#+SETUPFILE: ../manuscript.setup
#+INCLUDE: Infos.org
#+PROPERTY: header-args python :results output drawer :eval never-export :session Cecon
#+PROPERTY: header-args R :results output drawer :eval never-export :session Cecon
#+LATEX:\flushbottom % Makes all text pages the same height
#+LATEX:\maketitle % Print the title and abstract box
#+LATEX:\thispagestyle{empty} % Removes page numbering from the first page
#+LATEX: \onecolumn

** Python
#+BEGIN_SRC python
import pandas as pd
import numpy as np
from datetime import datetime as dt
from datetime import timedelta

from tabulate import tabulate

import matplotlib.pyplot as plt
import matplotlib.ticker as ticker
from matplotlib.ticker import FuncFormatter

import seaborn as sns
import pandas_datareader.data as web
import requests
import json

import country_converter as coco

cc = coco.CountryConverter()

import matplotlib.image as image

logo = "./figs/Cecon_Logo.png"
logo = image.imread(logo)
ax2 = plt.axes([0.135, 0.135, 0.2, 0.2])
corona_sp = "2020-03-24"
corona_sp_txt = "Início isolamento social em SP"

corona_60 = "2020-03-18"
corona_60_txt = "Mais de 60 casos de COVID-19"

start_year = "2018-01-01"
base = "2014-12-01"


def line_format(label):
    """
    Convert time label to the format of pandas line plot
    """
    month = label.month_name()[:3]
    if month == "Jan":
        month += f"\n{label.year}"
    return month


# ax.set_xticklabels(map(lambda x: line_format(x), df[start_year:].index))


def line_format_day(label):
    """
    Convert time label to the format of pandas line plot
    """
    month = label.month_name()[:3]
    day = label.day
    string = f"{day}/{month}"
    return month


def interpolator(df):
    for col in df:
        df[col] = pd.to_numeric(df[col], errors="coerce")
        df = df.resample("D").interpolate(method="time")

    return df


def line_format(label):
    """
    Convert time label to the format of pandas line plot
    """
    month = label.month_name()[:3]
    if month == "Jan":
        month += f"\n{label.year}"
    return month


def rebase(df, base=base):
    for col in df:
        df[col] = df[col].apply(lambda x: (100 * x) / df[col][base])
    return df


def consulta_bc(codigo_bcb, nome=["Nome da série"]):
    url = "http://api.bcb.gov.br/dados/serie/bcdata.sgs.{}/dados?formato=json".format(
        codigo_bcb
    )
    df = pd.read_json(url)
    df["data"] = pd.to_datetime(df["data"], dayfirst=True)
    df.set_index("data", inplace=True)
    df.index.name = ""
    df.columns = nome
    return df


def autolabel(rects):
    """
    Attach a text label above each bar displaying its height
    """
    for rect in rects:
        height = rect.get_height()
        ax.text(
            rect.get_x() + rect.get_width() / 2.0,
            1.05 * height,
            "%d" % int(height),
            ha="center",
            va="bottom",
        )


def add_value_labels(ax, spacing=5):
    """Add labels to the end of each bar in a bar chart.

    Arguments:
        ax (matplotlib.axes.Axes): The matplotlib object containing the axes
            of the plot to annotate.
        spacing (int): The distance between the labels and the bars.
    """

    # For each bar: Place a label
    for rect in ax.patches:
        # Get X and Y placement of label from rect.
        y_value = rect.get_height()
        x_value = rect.get_x() + rect.get_width() / 2

        # Number of points between bar and label. Change to your liking.
        space = spacing
        # Vertical alignment for positive values
        va = "bottom"

        # If value of bar is negative: Place label below bar
        if y_value < 0:
            # Invert space to place label below
            space *= -1
            # Vertically align label at top
            va = "top"

        # Use Y value as label and format number with one decimal place
        label = "{:.1f}".format(y_value)

        # Create annotation
        ax.annotate(
            label,  # Use `label` as label
            (x_value, y_value),  # Place label at end of the bar
            xytext=(0, space),  # Vertically shift label by `space`
            textcoords="offset points",  # Interpret `xytext` as offset in points
            ha="center",  # Horizontally center label
            va=va,
        )  # Vertically align label differently for
        # positive and negative values.
#+END_SRC

#+RESULTS:
:results:

(python3:39046): Gtk-[1;33mWARNING[0m **: [34m10:08:03.997[0m: Theme parsing error: gtk.css:1:117: Failed to import: Erro ao abrir arquivo /home/gpetrini/.local/share/gnome-shell/extensions/unite@hardpixel.eu/styles/buttons-right-always.css: Arquivo ou diretório inexistente
:end:
** R

#+begin_src R
library(sidrar)
library(tidyverse)
## library(data.table)
## library(dtplyr)
## library(dplyr, warn.conflicts = FALSE)
library(cowplot)
logo_file <- './figs/Cecon_Logo.png'
source('https://gist.githubusercontent.com/benmarwick/2a1bb0133ff568cbe28d/raw/fb53bd97121f7f9ce947837ef1a4c65a73bffb3f/geom_flat_violin.R')


                                        # funçãozinha dos esquemas --------------------------------------------------------------------

gen_poly <- function(x, .deg=3) {
  options(na.action="na.exclude")
  t <- 1:length(x)
  fit <- lm(x ~ poly(t, degree = .deg))
  pred <- predict(fit, data.frame(t = t))
  return(pred)
}


                                        # aplica na baguia toda -----------------------------------------------------------------------

deg <- 5 # degree do poly

argmax <- function(smoothed, w=1, ...) {
  require(zoo)
  n <- length(smoothed)
  smoothed <- zoo(smoothed)
  y.max <- rollapply(smoothed, 2*w+1, max, align="center")
  delta <- y.max - smoothed[-c(1:w, n+1-1:w)]
  i.max <- which(delta <= 0) + w
  return(i.max)
}
#+end_src

#+RESULTS:
:results:
── [1mAttaching packages[22m ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────── tidyverse 1.3.0 ──
[32m✔[39m [34mggplot2[39m 3.3.2     [32m✔[39m [34mpurrr  [39m 0.3.4
[32m✔[39m [34mtibble [39m 3.0.4     [32m✔[39m [34mdplyr  [39m 1.0.5
[32m✔[39m [34mtidyr  [39m 1.1.2     [32m✔[39m [34mstringr[39m 1.4.0
[32m✔[39m [34mreadr  [39m 1.4.0     [32m✔[39m [34mforcats[39m 0.5.0
── [1mConflicts[22m ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
[31m✖[39m [34mdplyr[39m::[32mfilter()[39m masks [34mstats[39m::filter()
[31m✖[39m [34mdplyr[39m::[32mlag()[39m    masks [34mstats[39m::lag()
:end:

** Baixando dados e criando nomes :ignore:
#+BEGIN_SRC sh :dir ./raw/ContasNacionais/ :exports none :eval no
wget -N --backups=1 ftp://ftp.ibge.gov.br/Contas_Nacionais/Contas_Nacionais_Trimestrais/Tabelas_Completas/Tab_Compl_CNT.zip
unzip -o Tab_Compl_CNT.zip
mv *.xls Tab_Compl_CNT.xlsx
#+END_SRC

#+BEGIN_SRC python
Colunas = [
    "Agropecuaria",
    "Industria Extrativa",
    "Industria de Transformacao",
    "Eletricidade e agua",
    "Construcao",
    "Total Industria",
    "Comercio",
    "Transporte, armazenagem e correio",
    "Informacao e comunicacao",
    "Atividades Financeiras",
    "Atividades Imobiliarias",
    "Outras atividades",
    "ADM, defesa, etc",
    "Total Servicos",
    "VA",
    "PIB",
    "Consumo das Familias",
    "Consumo do Governo",
    "FBCF",
    "Exportacao",
    "Importacao"
]

Agropecuaria = ['Agropecuaria']

Industria = [
    "Industria Extrativa",
    "Industria de Transformacao",
    "Eletricidade e agua",
    "Construcao",
    "Total Industria"
]

Servicos = [
    "Comercio",
    "Transporte, armazenagem e correio",
    "Informacao e comunicacao",
    "Atividades Financeiras",
    "Atividades Imobiliarias",
    "Outras atividades",
    "ADM, defesa, etc",
    "Total Servicos",
]

Demanda = [
    "Consumo das Familias",
    "Consumo do Governo",
    "FBCF",
    "Exportacao",
    "Importacao"
]

Oferta = [
    'Agropecuaria',
    "Total Industria",
    "Total Servicos",
]

df = pd.read_excel('./raw/ContasNacionais/Tab_Compl_CNT.xlsx', header=3, sheet_name='Val encad preços 95 com ajuste', index_col=0)
df.index = df.index.str.replace('.', 'Q').str.replace('IV', '4').str.replace('III', '3').str.replace('II', '2').str.replace('I', '1')
df.index = pd.PeriodIndex(df.index, freq='Q')
df.columns = Colunas
df["Importacao"] = -df["Importacao"]
#+END_SRC

#+RESULTS:
:results:
:end:

*** Carregano dados :ignore:

#+BEGIN_SRC python :exports none
Colunas = [
    "Agropecuaria",
    "Industria Extrativa",
    "Industria de Transformacao",
    "Eletricidade e agua",
    "Construcao",
    "Total Industria",
    "Comercio",
    "Transporte, armazenagem\ne correio",
    "Informacao e\ncomunicacao",
    "Atividades Financeiras",
    "Atividades Imobiliarias",
    "Outras atividades",
    "ADM, defesa, etc",
    "Total Servicos",
    "VA",
    "Imposto",
    "PIB",
    "Consumo\ndas Familias",
    "Consumo\ndo Governo",
    "FBCF",
    "Exportacao",
    "Importacao"
]

Agropecuaria = ['Agropecuaria']

Industria = [
    "Industria Extrativa",
    "Industria de Transformacao",
    "Eletricidade e agua",
    "Construcao",
    "Total Industria"
]

Servicos = [
    "Comercio",
    "Transporte, armazenagem\ne correio",
    "Informacao e\ncomunicacao",
    "Atividades Financeiras",
    "Atividades Imobiliarias",
    "Outras atividades",
    "ADM, defesa, etc",
    "Total Servicos",
]

Demanda = [
    "Consumo\ndas Familias",
    "Consumo\ndo Governo",
    "FBCF",
    "Exportacao",
    "Importacao"
]

Oferta = [
    'Agropecuaria',
    "Total Industria",
    "Total Servicos",
]

df = pd.read_excel('./raw/ContasNacionais/Tab_Compl_CNT.xlsx', header=3, sheet_name='Acum. em 4 trimestres', index_col=0)
df.index = df.index.str.replace('.', 'Q').str.replace('IV', '4').str.replace('III', '3').str.replace('II', '2').str.replace('I', '1')
df.index = pd.PeriodIndex(df.index, freq='Q')
df.columns = Colunas
df["Importacao"] = -df["Importacao"]
df.index = df.index.to_timestamp()
#+END_SRC

#+RESULTS:
:results:
:end:

*** PIB

#+BEGIN_SRC python :exports none
Colunas = [
    "Agropecuária",
    "Ind. Extrativa",
    "Ind. de Transformação",
    "Eletricidade e gás, água,esgoto,\nativ. de gestão de resíduos",
    "Construção",
    "Total Industria",
    "Comércio",
    "Transporte, armazenagem\ne correio",
    "Informação e\ncomunicação",
    "Ativ. Financeiras, de seguros e\nserviços relacionados",
    "Ativ. Imobiliárias",
    "Outras atividades de serviços",
    "Adm., defesa, saúde e educação\npúblicas e seguridade social",
    "Total Servicos",
    "VA",
    "Imposto",
    "PIB",
    "Consumo\ndas Familias",
    "Consumo\ndo Governo",
    "FBCF",
    "Exportacao",
    "Importacao",
]

Agropecuaria = ["Agropecuária"]

Industria = [
    "Ind. Extrativa",
    "Ind. de Transformação",
    "Eletricidade e gás, água,esgoto,\nativ. de gestão de resíduos",
    "Construção",
    # "Total Industria",
]

Servicos = [
    "Comércio",
    "Transporte, armazenagem\ne correio",
    "Informação e\ncomunicação",
    "Ativ. Financeiras, de seguros e\nserviços relacionados",
    "Ativ. Imobiliárias",
    "Outras atividades de serviços",
    "Adm., defesa, saúde e educação\npúblicas e seguridade social",
    # "Total Servicos",
]

Demanda = [
    "Consumo\ndas Familias",
    "Consumo\ndo Governo",
    "FBCF",
    "Exportacao",
    "Importacao",
]

Oferta = [
    "Agropecuaria",
    "Total Industria",
    "Total Servicos",
]

df = pd.read_excel(
    "./raw/ContasNacionais/Tab_Compl_CNT.xlsx",
    header=3,
    sheet_name="Acum. em 4 trimestres",
    index_col=0,
)
df.index = (
    df.index.str.replace(".", "Q")
    .str.replace("IV", "4")
    .str.replace("III", "3")
    .str.replace("II", "2")
    .str.replace("I", "1")
)
df.index = pd.PeriodIndex(df.index, freq="Q")
df.columns = Colunas
df["Importacao"] = -df["Importacao"]
df.index = df.index.to_timestamp()
#+END_SRC

#+RESULTS:
:results:
:end:

#+BEGIN_SRC python :results graphics file :file ./figs/PIB/PIB_Acum.pdf
df = pd.read_excel(
    "./raw/ContasNacionais/Tab_Compl_CNT.xlsx",
    header=3,
    sheet_name="Acum. em 4 trimestres",
    index_col=0,
)
df.index = (
    df.index.str.replace(".", "Q")
    .str.replace("IV", "4")
    .str.replace("III", "3")
    .str.replace("II", "2")
    .str.replace("I", "1")
)
df.index = pd.PeriodIndex(df.index, freq="Q")
df.columns = Colunas
df["Importacao"] = -df["Importacao"]
df.index = df.index.to_timestamp()
last = str(df.index.to_list()[-1]).split(" ")[0]
df = (
    df[last:][Servicos + Industria + Agropecuaria + ["PIB"]]
    .transpose()
    .sort_values("2020-10-01", ascending=False)
)


colors = "".join(["r" if col == "PIB" else "b" for col in df.index])

fig, ax = plt.subplots(figsize=(8, 5))
df.plot(
    title=f"Taxa (%) acumulada no ano em relação ao\nmesmo período do ano anterior",
    ax=ax,
    lw=1.5,
    legend=False,
    kind="bar",
    edgecolor="black",
    width=0.8,
    color=colors,
)
ax.set_yticklabels(["{:,.0%}".format(x / 100) for x in ax.get_yticks()])
ax.axhline(y=0, ls="-", lw=1.0, color="black")

add_value_labels(ax)

ax2 = plt.axes([0.1375, 0.135, 0.2, 0.2])
ax2.imshow(logo, aspect="auto", zorder=0, alpha=0.5)
ax2.axis("off")

sns.despine()
plt.close()

fig.savefig(
    "./figs/PIB/PIB_Acum" + ".pdf",
    dpi=300,
    bbox_inches="tight",
    pad_inches=0,
)
#+END_SRC

#+RESULTS:
[[file:./figs/PIB/PIB_Acum.pdf]]

* Crédito
#+begin_src python
start_year = '2019-01-01'
#+end_src

#+RESULTS:
:results:
:end:

*** Volume com ajuste sazonal


#+begin_src R :exports none
df <- get_sidra(
  api = "/t/6443/n1/all/v/8677/p/all/c11046/40312/c12355/31399,31426,106869,106874,106876,107071/d/v8677%201"
) %>%
  select( "Mês (Código)", "Atividades de serviços", "Valor") %>%
  mutate(Data =  paste0(`Mês (Código)`, "01")) %>%
  mutate(Data = as.Date(Data, format="%Y%m%d")) %>%
  select(-c(`Mês (Código)`)) %>%
  pivot_wider(names_from = "Atividades de serviços", values_from = Valor)

names(df) <- c(
  "Data",
  "Profissionais, Administrativos e Complementares",
  "Outros",
  "Prestados às famílias",
  "Informação e comunicação",
  "Transportes, Serviços auxiliares e Correio",
  "Total"
  )
write.csv(
  df,
  './clean/IBGE/PMS_volume_dessazonalizada.csv',
  row.names=FALSE
)
#+end_src

#+RESULTS:
:results:
All others arguments are desconsidered when 'api' is informed
:end:

#+BEGIN_SRC python  :results graphics file :file ./figs/Setoriais/PMS_vol_dessazonalizada.pdf
df = pd.read_csv(
    "./clean/IBGE/PMS_volume_dessazonalizada.csv", index_col="Data", parse_dates=True
)

df.index.name = ""

for col in df:
    df[col] = df[col].apply(lambda x: (100 * x) / df[col].loc[base])

df = df[start_year:]
df = interpolator(df)

fig, ax = plt.subplots(figsize=(8, 5))
df.plot(
    title=f"Pesquisa Mensal de Serviços (PMS)\nÍndice de Volume de serviços dessazonalizado\n{base} = 100",
    ax=ax,
    lw=2.5,
)
ax.axvline(x=corona_sp, color="black", ls="--", lw=1, label="Início isolamento em SP")
ax.legend(loc="center left", bbox_to_anchor=(1, 0.5))
ax2 = plt.axes([0.135, 0.135, 0.2, 0.2])
ax2.imshow(logo, aspect="auto", zorder=0, alpha=0.5)
ax2.axis("off")

sns.despine()
plt.close()

fig.savefig(
    "./figs/Setoriais/PMS_vol_dessazonalizada" + ".pdf",
    dpi=300,
    bbox_inches="tight",
    pad_inches=0,
)
#+END_SRC

#+RESULTS:
[[file:./figs/Setoriais/PMS_vol_dessazonalizada.pdf]]

*** Volume com ajuste sazonal (em relação ao mês anterior)


#+begin_src R :exports none
df <- get_sidra(
  api = "/t/6443/n1/all/v/8677/p/all/c11046/40312/c12355/31399,31426,106869,106874,106876,107071/d/v8677%201"
) %>%
  select( "Mês (Código)", "Atividades de serviços", "Valor") %>%
  mutate(Data =  paste0(`Mês (Código)`, "01")) %>%
  mutate(Data = as.Date(Data, format="%Y%m%d")) %>%
  select(-c(`Mês (Código)`)) %>%
  pivot_wider(names_from = "Atividades de serviços", values_from = Valor)

names(df) <- c(
  "Data",
  "Profissionais, Administrativos e Complementares",
  "Outros",
  "Prestados às famílias",
  "Informação e comunicação",
  "Transportes, Serviços auxiliares e Correio",
  "Total"
  )
write.csv(
  df,
  './clean/IBGE/PMS_volume_dessazonalizada.csv',
  row.names=FALSE
)
#+end_src

#+RESULTS:
:results:
All others arguments are desconsidered when 'api' is informed
:end:

#+BEGIN_SRC python  :results graphics file :file ./figs/Setoriais/PMS_vol_dessazonalizada_diff.pdf
df = pd.read_csv(
    "./clean/IBGE/PMS_volume_dessazonalizada.csv", index_col="Data", parse_dates=True
)

df.index.name = ""

for col in df:
    df[col] = df[col].apply(lambda x: (100 * x) / df[col].loc[base])

df = df["2020-01-01":]
df = interpolator(df)

fig, ax = plt.subplots(figsize=(8, 5))
df.diff().plot(
    title=f"Pesquisa Mensal de Serviços (PMS)\nÍndice de Volume de serviços dessazonalizado\nComparado ao mês anterior",
    ax=ax,
    lw=2.5,
)
ax.axvline(x=corona_sp, color="black", ls="--", lw=1, label="Início isolamento em SP")
ax.axhline(y=0, color="black", ls="-", lw=1)
ax.legend(loc="center left", bbox_to_anchor=(1, 0.5))
ax2 = plt.axes([0.135, 0.135, 0.2, 0.2])
ax2.imshow(logo, aspect="auto", zorder=0, alpha=0.5)
ax2.axis("off")

sns.despine()
plt.close()

fig.savefig(
    "./figs/Setoriais/PMS_vol_dessazonalizada_diff" + ".pdf",
    dpi=300,
    bbox_inches="tight",
    pad_inches=0,
)
#+END_SRC

#+RESULTS:
[[file:./figs/Setoriais/PMS_vol_dessazonalizada_diff.pdf]]

** Rendimento habitual médio por atividade


#+BEGIN_SRC python   :tangle ./codes/pnad.py :eval no
df = pd.read_excel(
    file_path,
    sheet_name = "Brasil Mensal RHM Setor Real",
    skiprows = 11,
    usecols = "A:K",
    parse_date = True,
    index_col = [0]
)
df.index.name = ''
df = df[start_year:]
df = interpolator(df)

fig, ax = plt.subplots(figsize=(8,5))
df.plot(
    title = "Rendimento habitual médio por atividade",
    ax = ax,
    lw = 2.5
)
ax.axvline(x = corona_sp, color='black', ls='--', lw=1, label='Início isolamento social em SP')
ax.legend(loc='center left', bbox_to_anchor=(1, 0.5))
ax2 = plt.axes([0.135,0.135,0.2,0.2])
ax2.imshow(logo, aspect='auto', zorder=0, alpha=.5)
ax2.axis('off')

sns.despine()
plt.close()

fig.savefig(
    image_path + file_path.strip("/")[-1] + "RHM_Setor" + "_" + '.pdf',
    dpi = 300, 
    bbox_inches='tight',pad_inches=0
    )
#+END_SRC

#+RESULTS:
:results:
:end:

** Desalentados e subocupados :noexport:

#+BEGIN_SRC python   :tangle ./codes/pnad.py :eval no
var = "Desalentados_Subocupados"
df = pd.read_excel(
    file_path,
    sheet_name = "Brasil Dessaz",
    skiprows = 11,
    usecols = "A,D,S,T",
    parse_date = True,
    index_col = [0]
)
df.index.name = ''
df.columns = [
    "Força de trabalho",
    "Subocupados",
    "Desalentados"
]
df = df.apply(pd.to_numeric, errors='coerce')
df["Taxa de desalentados"] = df["Desalentados"]/df["Força de trabalho"]
df["Taxa de Subocupados por \ninsuficiência de horas trabalhadas"] = df["Subocupados"]/df["Força de trabalho"]
df = df[start_year:]
df = df[["Taxa de desalentados", "Taxa de Subocupados por \ninsuficiência de horas trabalhadas"]]
df = interpolator(df)

fig, ax = plt.subplots(figsize=(8,5))
df.plot(
    title = "Taxa de desalentados e subocupatos\n(em % da força de trabalho)",
    ax = ax,
    lw = 2.5
)
ax.axvline(x = corona_sp, color='black', ls='--', lw=1, label='Início isolamento social em SP')
ax.legend(loc='center left', bbox_to_anchor=(1, 0.5))
ax2 = plt.axes([0.135,0.135,0.2,0.2])
ax2.imshow(logo, aspect='auto', zorder=0, alpha=.5)
ax2.axis('off')

sns.despine()
plt.close()

fig.savefig(
    image_path + file_path.strip("/")[-1] + var.replace(" ", "_") + "_" + '.pdf',
    dpi = 300,
    bbox_inches='tight',pad_inches=0
    )
#+END_SRC

#+RESULTS:
:results:
:end:

*** Our world data

#+BEGIN_SRC python
df = pd.read_csv(
    "https://raw.githubusercontent.com/owid/covid-19-data/master/public/data/owid-covid-data.csv",
    index_col="date",
    parse_dates=True,
    usecols=[  # subseting
        "date",
        "iso_code",
        "continent",
        "total_cases",
        "total_deaths",
        "new_cases_smoothed",
        "new_deaths_smoothed",
        "new_deaths_per_million",
        "new_cases_per_million",
        "new_cases_smoothed_per_million",
        "new_deaths_smoothed_per_million",
        "new_tests_smoothed_per_thousand",
        "people_fully_vaccinated",
        "new_vaccinations_smoothed_per_million",
        "stringency_index",
        "new_vaccinations_smoothed_per_million",
    ],
)
df[["stringency_index"]] = df[["stringency_index"]].shift(14)
df = df.groupby("iso_code").rolling(window=14).mean().reset_index().set_index("date")
df.to_csv("./clean/COVID/cases_deaths.csv")
#+END_SRC

#+RESULTS:
:results:
:end:

*** Stringency 


#+BEGIN_SRC python
df = pd.read_csv(
    "https://raw.githubusercontent.com/OxCGRT/covid-policy-tracker/master/data/OxCGRT_latest.csv",
    index_col="Date",
    parse_dates=True,
    usecols=[  # subseting
        "Date",
        "CountryCode",
        "C1_School closing",
        "C1_Flag",
        "C2_Workplace closing",
        "C2_Flag",
        "C3_Cancel public events",
        "C3_Flag",
        "C4_Restrictions on gatherings",
        "C4_Flag",
        "C5_Close public transport",
        "C5_Flag",
        "C6_Stay at home requirements",
        "C6_Flag",
        "C7_Restrictions on internal movement",
        "C7_Flag",
        "C8_International travel controls",
    ],
)

closure = [
    "C1_School closing",
    "C2_Workplace closing",
    "C3_Cancel public events",
    "C4_Restrictions on gatherings",
    "C5_Close public transport",
    "C6_Stay at home requirements",
    "C7_Restrictions on internal movement",
    "C8_International travel controls",
]

flags = [
    "C1_Flag",
    "C2_Flag",
    "C3_Flag",
    "C4_Flag",
    "C5_Flag",
    "C6_Flag",
    "C7_Flag",
]

df["Closure"] = (
    df.reset_index().set_index("CountryCode")[closure].mean(axis="columns").values
)
# df = df[df["Closure"].diff() != 0]
df["Restrict"] = [i > 0 for i in df["Closure"].diff() > 0]
df = df[["CountryCode", "Closure", "Restrict"]].dropna()
df.columns = ["iso_code", "Closure", "Restrict"]
df.index.name = "date"  # for merging purposes
df.to_csv("./clean/COVID/closes.csv")
#+END_SRC

#+RESULTS:
:results:
:end:

*** Google mobility

#+BEGIN_SRC python
url = "https://www.gstatic.com/covid19/mobility/Global_Mobility_Report.csv"

cols = [
    "country_region",
    "sub_region_1",
    "sub_region_2",
    "metro_area",
    "iso_3166_2_code",
    "census_fips_code",
    "date",
    "retail_and_recreation_percent_change_from_baseline",
    "grocery_and_pharmacy_percent_change_from_baseline",
    "parks_percent_change_from_baseline",
    "transit_stations_percent_change_from_baseline",
    "workplaces_percent_change_from_baseline",
    "residential_percent_change_from_baseline",
]

df = pd.read_csv(
    url,
    usecols=cols,
    parse_dates=True,
    dtype={
        "country_region": str,
        "sub_region_1": str,
        "sub_region_2": str,
        "metro_area": str,
        "iso_3166_2_code": str,
        "census_fips_code": str,
        "date": str,
        "retail_and_recreation_percent_change_from_baseline": np.float64,
        "grocery_and_pharmacy_percent_change_from_baseline": np.float64,
        "parks_percent_change_from_baseline": np.float64,
        "transit_stations_percent_change_from_baseline": np.float64,
        "workplaces_percent_change_from_baseline": np.float64,
        "residential_percent_change_from_baseline": np.float64,
    },
)
# Convert date column to days of the year
# df['date'] = pd.to_datetime(df['date'], format="%Y/%m/%d", utc=True)


# Remove subnational data, keeping only country figures
filter_cols = [
    "sub_region_1",
    "sub_region_2",
    "metro_area",
    "iso_3166_2_code",
    "census_fips_code",
]
df = df[df[filter_cols].isna().all(1)]

# Delete columns
df = df.drop(
    [
        # "country_region",
        "sub_region_1",
        "sub_region_2",
        "metro_area",
        "census_fips_code",
        "iso_3166_2_code",
    ],
    axis="columns",
)


# Standardise country names to OWID country names
df = df.reset_index().set_index("country_region")
df.index = cc.convert(
    names=list(df.index), to="ISO3", not_found=None
)  # To avoid string problems
df = df.reset_index().set_index("date").drop("index", axis="columns")
# Converting the index as date
df.index = pd.to_datetime(df.index)
# Assign new column names
rename_dict = {
    "date": "Date",
    "level_0": "iso_code",
    "retail_and_recreation_percent_change_from_baseline": "Retail & Recreation",
    "grocery_and_pharmacy_percent_change_from_baseline": "Grocery & Pharmacy",
    "parks_percent_change_from_baseline": "Parks",
    "transit_stations_percent_change_from_baseline": "Transit Stations",
    "workplaces_percent_change_from_baseline": "Workplaces",
    "residential_percent_change_from_baseline": "Residential",
}

# Rename columns
df = df.rename(columns=rename_dict)
df["Isolamento"] = df["Residential"].pct_change(7)
df.to_csv("./clean/COVID/google_mobility.csv")
#+END_SRC

#+RESULTS:
:results:
:end:

** Merging :noexport:


#+begin_src R
df <-read_csv(
  './clean/COVID/cases_deaths.csv',
  guess_max = 3000
)  %>% arrange(iso_code)

tmp <- read_csv(
  './clean/COVID/closes.csv'
)  %>% arrange(iso_code)
df <- df %>% left_join(tmp)
# check if full_join or right or left join
tmp <- read_csv(
  './clean/COVID/google_mobility.csv'
)  %>% arrange(iso_code)
df <- df %>% left_join(tmp)
df <- df %>%
  mutate(Policy_change = c(NA, diff(Closure))) %>%
  mutate(Restrict = Policy_change > 0) %>%
  mutate(stayhome_growth = (Residential/lag(Residential) - 1) * 100) %>%
  mutate(stayhome_growth_7 = (Residential/lag(Residential,7) - 1) * 100) %>%
  mutate(stayhome_growth_14 = (Residential/lag(Residential,14) - 1) * 100) %>%
  mutate(Isolamento = case_when(
     stayhome_growth > 0 & Restrict == TRUE ~ "Imposto", # Queda da mobilidade junto da imposição
     stayhome_growth > 0 & Restrict == FALSE ~ "Voluntário", # Queda da mobilidade sem restrição
     stayhome_growth <= 0 ~ "Queda",
           )) %>%
  mutate(Isolamento_14 = case_when(
     stayhome_growth_14 > 0 & Restrict == TRUE ~ "Imposto", # Queda da mobilidade junto da imposição
     stayhome_growth_14 > 0 & Restrict == FALSE ~ "Voluntário", # Queda da mobilidade sem restrição
     stayhome_growth_14 <= 0 ~ "Queda",
           )) %>%
  mutate(Isolamento_7 = case_when(
     stayhome_growth_7 > 0 & Restrict == TRUE ~ "Imposto", # Queda da mobilidade junto da imposição
     stayhome_growth_7 > 0 & Restrict == FALSE ~ "Voluntário", # Queda da mobilidade sem restrição
     stayhome_growth_7 <= 0 ~ "Queda",
           )) %>%
  mutate(Isolamento = as.factor(Isolamento)) %>%
  mutate(Isolamento_7 = as.factor(Isolamento_7)) %>%
  mutate(Isolamento_14 = as.factor(Isolamento_14)) %>%
  mutate(cases_growth = (new_cases_per_million/lag(new_cases_per_million) - 1) * 100) %>%
  mutate(deaths_growth = (new_deaths_per_million/lag(new_deaths_per_million) - 1) * 100) %>%
  mutate(vaccine_growth = (people_fully_vaccinated/lag(people_fully_vaccinated) - 1) * 100) %>%
  distinct(date, iso_code, .keep_all = TRUE)

write.csv(
  df,
  './clean/COVID/cases_closes_google_merged.csv',
  row.names = FALSE
)
#+end_src

#+RESULTS:
:results:

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  date = [34mcol_date(format = "")[39m,
  iso_code = [31mcol_character()[39m,
  total_cases = [32mcol_double()[39m,
  new_cases_smoothed = [32mcol_double()[39m,
  total_deaths = [32mcol_double()[39m,
  new_deaths_smoothed = [32mcol_double()[39m,
  new_cases_per_million = [32mcol_double()[39m,
  new_cases_smoothed_per_million = [32mcol_double()[39m,
  new_deaths_per_million = [32mcol_double()[39m,
  new_deaths_smoothed_per_million = [32mcol_double()[39m,
  new_tests_smoothed_per_thousand = [32mcol_double()[39m,
  people_fully_vaccinated = [32mcol_double()[39m,
  new_vaccinations_smoothed_per_million = [32mcol_double()[39m,
  stringency_index = [32mcol_double()[39m
)

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  date = [34mcol_date(format = "")[39m,
  iso_code = [31mcol_character()[39m,
  Closure = [32mcol_double()[39m,
  Restrict = [33mcol_logical()[39m
)
Joining, by = c("date", "iso_code")

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  date = [34mcol_date(format = "")[39m,
  iso_code = [31mcol_character()[39m,
  `Retail & Recreation` = [32mcol_double()[39m,
  `Grocery & Pharmacy` = [32mcol_double()[39m,
  Parks = [32mcol_double()[39m,
  `Transit Stations` = [32mcol_double()[39m,
  Workplaces = [32mcol_double()[39m,
  Residential = [32mcol_double()[39m,
  Isolamento = [32mcol_double()[39m
)
Joining, by = c("date", "iso_code")
:end:

** Adaptando dataframe :noexport:

#+begin_src R
df <-read_csv(
  './clean/COVID/cases_closes_google_merged.csv',
  guess_max = 3000
) %>%
  mutate(Isolamento = as.factor(Isolamento)) %>%
  mutate(Isolamento_7 = as.factor(Isolamento_7)) %>%
  mutate(Isolamento_14 = as.factor(Isolamento_14)) %>%
  select(date,
         iso_code,
         new_cases_per_million,
         new_cases_smoothed_per_million,
         cases_growth,
         deaths_growth,
         vaccine_growth,
         Policy_change,
         Restrict,
         Isolamento,
         Isolamento_7,
         Isolamento_14,
         Residential,
         Closure,
         stayhome_growth,
         stayhome_growth_7,
         stayhome_growth_14,
         vaccine_growth,
         total_deaths
         ) %>%
  mutate(cases_growth_after14 = lead(cases_growth, 14)) %>%
  filter(
    date > as.Date("2020-02-01"), # same start date for all
    cases_growth < 10, # Removing outliers
    cases_growth > -10,
    cases_growth>-50,
    ## cases_growth_after14 > -10,
    ## cases_growth_after14<10,
    ## stayhome_growth_7<100,
    total_deaths >= 5
    ) %>%
  ## drop_na(Isolamento, Isolamento_7, Isolamento_14, cases_growth, Policy_change) %>%
  filter(iso_code %in% c(
                       "ARG",
                       ## "AUS",
                       ## "BEL",
                       "BOL",
                       "BRA",
                       ## "CAN",
                       ## "CHE",
                       "CHL",
                       "COL",
                       "DEU",
                       "DNK",
                       "ECU",
                       "ESP",
                       "FIN",
                       "FRA",
                       "GBR",
                       ## "IND",
                       ## "IRL",
                       "ISR",
                       "ITA",
                       "JPN",
                       "KOR",
                       "MEX",
                       "NDL",
                       "NOR",
                       ## "NZL",
                       "PRT",
                       "PRY",
                       ## "RUS",
                       "SWE",
                       "URY",
                       "USA",
                       "VEN"
                       ## "ZAF"
                     )) %>%
  mutate(iso_code = as.factor(iso_code)) %>%
  mutate(Policy = case_when(
           Policy_change > 0 ~ "Restrição",
           Policy_change < 0 ~ "Flexibilização",
           Policy_change == 0 ~ "Sem mudanças"
         )) %>%
  mutate(Policy = as.factor(Policy)) %>%
  mutate(cases_rolling_14 = zoo::rollapply(cases_growth, width = 14, FUN = mean, fill = NA)) %>%
  mutate(cum_negative_day = zoo::rollapply(cases_rolling_14 < 0, width=14, FUN = sum, fill = NA))

ylab = "Taxa de crescimento de casos"
w <- 14*2
th_new_cases <- 100

df <- df %>%
  mutate(y.max = zoo::rollapply(new_cases_smoothed_per_million, 2*w +1, max, fill = NA, align="center")) %>%
  mutate(delta = y.max - new_cases_smoothed_per_million) %>%
  mutate(Pico = new_cases_smoothed_per_million >= 200 & delta <=0) %>%
  group_by(iso_code) %>%
  fill(Pico, .direction = "up") %>%
  mutate(nPico = cumsum(Pico)) %>%
  ungroup() %>%
  mutate(Onda = case_when(
           total_deaths >= th_new_cases & nPico == 0 ~ "Início ao 1o pico",
           total_deaths >=th_new_cases & nPico == 1 ~ "1o ao 2o Pico",
           total_deaths >= th_new_cases & nPico >= 2 ~ "pós 2o pico"
         )) %>%
  mutate(Onda = as.factor(Onda)) %>%
  fill(Onda) %>%
  fill(Onda, .direction = "up") %>%
  mutate(Onda = fct_relevel(Onda, "Início ao 1o pico", "1o ao 2o Pico", "pós 2o pico"))

write.csv(
  df,
  './clean/COVID/casos_TipoIsolamento_Onda.csv',
  row.names = FALSE
)
#+end_src

#+RESULTS:
:results:

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  .default = col_double(),
  date = [34mcol_date(format = "")[39m,
  iso_code = [31mcol_character()[39m,
  Restrict = [33mcol_logical()[39m,
  Isolamento = [31mcol_character()[39m,
  Isolamento_14 = [31mcol_character()[39m,
  Isolamento_7 = [31mcol_character()[39m
)
[36mℹ[39m Use [30m[47m[30m[47m`spec()`[47m[30m[49m[39m for the full column specifications.
:end:



** Inspeção dos picos

#+begin_src R :results value file :var figname="Picos"

name = paste0('./figs/COVID/', figname, ".pdf")
    
# https://stackoverflow.com/questions/10942360/how-to-get-geom-vline-to-honor-facet-wrap
df_inf <- df %>% 
  group_by(iso_code) %>% 
  summarise(vline = date[Pico==1])

df %>% ggplot(aes(x=date)) + geom_line(aes(y=new_cases_smoothed_per_million), color="black", linetype="dashed") + 
  geom_line(aes(y=new_cases_per_million), color="red") +
  geom_vline(
    data = df_inf, 
    mapping = aes(xintercept = vline)
  ) +
  labs(
    y = "Novos casos por milão de habitantes",
    x = "Data"
  ) +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) + 
 guides(fill=guide_legend(title="Países")) +
  facet_wrap(~iso_code) ->fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.95, y = 0.15, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 30, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Picos.pdf]]
:end:

** Novos casos por milhão x Fase pandemia (sem aparar dados)

#+ATTR_LATEX: :environment longtable :align c|p{2cm}|p{5cm}|p{5cm}|p{3cm}
|---------+------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Eixo    | Nome                               | Descrição                                                                                                                                                                                                                                                                                                              | Ajuste                                                                                                                | Motivo                                                                                                                                                                                                 |
|---------+------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Y       | Taxa de crescimento de novos casos | Taxa de crescimento dos novos casos de COVID-19 por milhão de habitantes                                                                                                                                                                                                                                               | Foram removidos casos em que a taxa de crescimento foi acima de 10% e menor de -10% em relação ao dia anterior        | Remover potenciais outliers                                                                                                                                                                            |
|---------+------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| X       | Fase da pandemia                   | Descreve se a pandemia ocorreu antes do primeiro pico após as 5 primeiras mortes; desde o primeiro pico ate o pico da segunda onda e; pós-segunda onda para captar países em que a pandemia não esta controlada.                                                                                                       | Se o número de novos casos por milhão for menor que 100, não será categorizado como pico da respectiva onda.          | Não classificar máximos locais em uma janela pequena como um pico e, por consequência, incluir mais picos do que os existentes.                                                                        |
|---------+------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Cores   | Tipo de isolamento                 | Se o tempo que as pessoas ficaram em casa (em relação à 14 dias atrás) aumentar e não houver medida de restrição no dia, voluntário. Se o tempo que as pessoas ficaram em casa (em relação à 14 dias atrás) aumentar e houver medida de restrição, imposto. Se o tempo que as pessoas ficaram em casa diminuiu, queda. | Foram removidos casos em que a taxa de variação do tempo que as pessoas ficaram em casa for maior que 100% em módulo. | Para remover possívies outlier. Foi considerada a comparação com 14 dias atrás para evitar efeitos do fim de semana e contemplar situações em que as medidas de restrições não foram de curta duração. |
|---------+------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Largura | -                                  | Os boxplots serão tão mais largos quanto mais observações existirem para a fase da pandemia. Assim, um boxplot mais largo no pós-segundo pico indica que exitem mais observaçeõs se comparados com o restante da pandemia.                                                                                             | -                                                                                                                     | -                                                                                                                                                                                                      |
|---------+------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Altura  | -                                  | Os boxplots serão tão mais altos quanto maior a dispersão nas taxas de crescimento                                                                                                                                                                                                                                     | -                                                                                                                     | -                                                                                                                                                                                                      |
|---------+------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|

#+begin_src R :results value file :var figname="Casos_Policy_Todos"

name = paste0('./figs/COVID/', figname, ".pdf")
    
df %>%
  ## filter(
  ##   ## Policy_change != 0,
  ##   new_cases_per_million > 10
  ## ) %>%
  drop_na(Onda, cases_growth, Isolamento_14) %>%
  ggplot(aes(y=Onda, x= cases_growth, fill=Isolamento_14)) +
  geom_vline(xintercept=0, color="black") + 
  geom_boxplot(alpha=0.5) +
  geom_boxplot(outlier.shape = NA) +
  labs(
    y = "Fase da Pandemia",
    x = ylab
  ) +
  ## scale_fill_manual(values=c("#FF0000", "#00FF00","#0000FF")) + 
  coord_flip() +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) + 
 guides(fill=guide_legend(title="Tipo de isolamento")) +
 facet_wrap(~iso_code) -> fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.975, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 20, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Casos_Policy_Todos.pdf]]
:end:

** Novos casos por milhão x Fase pandemia (mais de 50 casos por milhão de habitante para todos os dias)

#+begin_src R :results value file :var figname="Casos_Policy_50_Todos"

name = paste0('./figs/COVID/', figname, ".pdf")
    
df %>%
  filter(
    ## Policy_change != 0,
    new_cases_per_million > 50
  ) %>%
  drop_na(Onda, cases_growth, Isolamento_14) %>%
  ggplot(aes(y=Onda, x= cases_growth, fill=Isolamento_14)) +
  geom_vline(xintercept=0, color="black") + 
  geom_boxplot(alpha=0.5) +
  geom_boxplot(outlier.shape = NA) +
  labs(
    y = "Fase da Pandemia",
    x = ylab
  ) +
  ## scale_fill_manual(values=c("#FF0000", "#00FF00","#0000FF")) + 
  coord_flip() +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) + 
 guides(fill=guide_legend(title="Tipo de isolamento")) +
 facet_wrap(~iso_code) -> fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.975, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 20, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Casos_Policy_50_Todos.pdf]]
:end:

** Novos casos por milhão x Fase pandemia (mais de 100 casos por milhão de habitante para todos os dias)

#+begin_src R :results value file :var figname="Casos_Policy_100_Todos"

name = paste0('./figs/COVID/', figname, ".pdf")

df %>%
  filter(
    ## Policy_change != 0,
    new_cases_per_million > 100
  ) %>%
  drop_na(Onda, cases_growth, Isolamento_14) %>%
  ggplot(aes(y=Onda, x= cases_growth, fill=Isolamento_14)) +
  geom_vline(xintercept=0, color="black") +
  geom_boxplot(alpha=0.5) +
  geom_boxplot(outlier.shape = NA) +
  labs(
    y = "Fase da Pandemia",
    x = ylab
  ) +
  ## scale_fill_manual(values=c("#FF0000", "#00FF00","#0000FF")) +
  coord_flip() +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
 guides(fill=guide_legend(title="Tipo de isolamento")) +
 facet_wrap(~iso_code) -> fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.975, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 20, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Casos_Policy_100_Todos.pdf]]
:end:
